request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://roast.io">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getItemRequest>
         <gs:query>Lorem</gs:query>
      </gs:getItemRequest>
   </soapenv:Body>
</soapenv:Envelope>
